Tekla.Structures.Model.Internal.Connect
Provides functionalty for retrieving info regarding the Trimble Connect uploads.

Tekla.Structures.Model.Internal.Connect.ProjectIdUDA
Current Connect ProjectId UDA

Tekla.Structures.Model.Internal.Connect.GetUploads(Tekla.Structures.Model.ModelInfo,Tekla.Structures.Model.ProjectInfo)
Gets the uploads for the specified model and project info.
modelInfo: The model information.
projectInfo: The project information.
Returns: The uploads for the specified model and project.

Tekla.Structures.Model.Internal.Connect.GetProjectId(Tekla.Structures.Model.ProjectInfo)
Gets the ProjectIdUDA id of opened tekla model. Is the same ID as trimble connect project of the model.
Returns: A tuple containing: projectId (the trimble project ID) and region (the project region).